Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбАвторе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаПрофиля</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Достижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Достижения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДвадцатьВопросовЗаШестьдесятСекунд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеВосхождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерияДвадцатьПравильных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоВопросовСыграно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТридцатьВопросовБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоПятнадцатьСборников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Отображает ЭлементыВыклИзм либо ЭлементыВклИзм в зависимости от того
// припсутсвует ли достижение ДостижениеВход в массиве МассивДостиженийВход.
&НаСервере
Процедура ОтобразитьКартинкуДостижения(ДостижениеВход, ЭлементыВыклИзм, ЭлементыВклИзм, МассивДостиженийВход)
	ДостижениеНайдено = (МассивДостиженийВход.Найти(ДостижениеВход) <> Неопределено);
	ЭлементыВыклИзм.Видимость = Не ДостижениеНайдено;
	ЭлементыВклИзм.Видимость = ДостижениеНайдено;
КонецПроцедуры		// ОтобразитьКартинкуДостижения()

// Отображает достижения пользователя ПользовательВход на форме.
&НаСервере
Процедура ОтобразитьДостиженияПользователя(ПользовательВход)
	ДостижениеСтоВопросовСыграно					 = Перечисления.Достижения.СтоВопросовСыграно;
	ДостижениеТридцатьВопросовБезОшибок				 = Перечисления.Достижения.ТридцатьВопросовБезОшибок;
	ДостижениеСерияДвадцатьПравильных				 = Перечисления.Достижения.СерияДвадцатьПравильных;
	ДостижениеУстановленоПятнадцатьСборников		 = Перечисления.Достижения.УстановленоПятнадцатьСборников;
	ДостижениеДвадцатьВопросовЗаШестьдесятСекунд	 = Перечисления.Достижения.ДвадцатьВопросовЗаШестьдесятСекунд;
	ДостижениеЗавершениеВосхождения					 = Перечисления.Достижения.ЗавершениеВосхождения;
	МассивДостиженийПользователя = ОбщегоНазначенияВызовСервера.ПолучитьМассивДостиженийПользователя(ПользовательВход);
	ОтобразитьКартинкуДостижения(ДостижениеСтоВопросовСыграно,					 Элементы.ДекорацияСтоВопросовВыкл,							 Элементы.ДекорацияСтоВопросовВкл,							 МассивДостиженийПользователя);
	ОтобразитьКартинкуДостижения(ДостижениеТридцатьВопросовБезОшибок,			 Элементы.ДекорацияТридцатьПравильныхВыкл,					 Элементы.ДекорацияТридцатьПравильныхВкл,					 МассивДостиженийПользователя);
	ОтобразитьКартинкуДостижения(ДостижениеСерияДвадцатьПравильных,				 Элементы.ДекорацияСерияДвадцатьВыкл,						 Элементы.ДекорацияСерияДвадцатьВкл,						 МассивДостиженийПользователя);
	ОтобразитьКартинкуДостижения(ДостижениеУстановленоПятнадцатьСборников,		 Элементы.ДекорацияУстановленоПятнадцатьСборниковВыкл,		 Элементы.ДекорацияУстановленоПятнадцатьСборниковВкл,		 МассивДостиженийПользователя);
	ОтобразитьКартинкуДостижения(ДостижениеДвадцатьВопросовЗаШестьдесятСекунд,	 Элементы.ДекорацияДвадцатьВопросовЗаШестьдесятСекундВыкл,	 Элементы.ДекорацияДвадцатьВопросовЗаШестьдесятСекундВкл,	 МассивДостиженийПользователя);
	ОтобразитьКартинкуДостижения(ДостижениеЗавершениеВосхождения,				 Элементы.ДекорацияЗавершениеВосхожденияВыкл,				 Элементы.ДекорацияЗавершениеВосхожденияВкл,				 МассивДостиженийПользователя);
КонецПроцедуры		// ОтобразитьДостиженияПользователя()

// Выводит на форму дополнительные данные пользователя.
&НаСервере
Процедура ОбновитьДанныеПользователя(ПользовательВход)
	СтруктураДанныхПользователя = Справочники.Пользователи.ВернутьДанныеПользователя(ПользовательВход);
	Уровень = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхПользователя, "Уровень", 0);
КонецПроцедуры		// ОбновитьДанныеПользователя()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеПользователя(Объект.Ссылка);
	ОтобразитьДостиженияПользователя(Объект.Ссылка);
	СтрокаКартинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "КартинкаПрофиля");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПрофиляНажатие(Элемент, СтандартнаяОбработка)
	Попытка
		СтандартнаяОбработка = Ложь;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Фильтр = "JPEG (*.jpg)|*.jpg|PNG (*.png)|*.png|Все файлы (*.*)|*.*";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.Заголовок = "Выберите фотографию";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
			Для Каждого ТекМассивФайлов Из МассивФайлов Цикл
				ТекКартинка = Новый Картинка(ТекМассивФайлов);
				СтрокаКартинка = ПоместитьВоВременноеХранилище(ТекКартинка, УникальныйИдентификатор);
			КонецЦикла;
			Модифицированность = Истина;
		Иначе
			Сообщить("Файл не выбран. Фотография не изменена.");
		КонецЕсли;
	Исключение
		Сообщить("Произошла ошибка при открытии фотографии: " + ОписаниеОшибки());
	КонецПопытки
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(СтрокаКартинка) Тогда
		Если ЭтоАдресВременногоХранилища(СтрокаКартинка) Тогда
			ПолученнаяКартинка = ПолучитьИзВременногоХранилища(СтрокаКартинка);
			ТекущийОбъект.КартинкаПрофиля = Новый ХранилищеЗначения(ПолученнаяКартинка);
		Иначе
			//Не адрес. Нельзя записывать.
		КонецЕсли;
	Иначе
		//Нет ссылки
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьЛичныеДанные");
КонецПроцедуры
